Revit 2027 API
ScheduleFilter.GetElementIdValue Method
 Gets the filter value for a filter using an ElementId value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetElementIdValue()
Public Function GetElementIdValue As ElementId
public:
ElementId^ GetElementIdValue()
member GetElementIdValue : unit -> ElementId
Return Value
ElementId
 The filter value.
Exceptions
Exception | Condition
InvalidOperationException |  The filter value is not an ElementId.
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace